benchmark.yml
config:
    target: "ws://localhost:3000/ws"
    phases:
      - duration: 60  # Test for 60 seconds
        arrivalRate: 10 # Every second, add 10 users
        rampTo: 100 # And ramp it up to 100 users in total over the 60s period
        name: "Ramping up the load"
      - duration: 120 # Then resume the load test for 120s
        arrivalRate: 100 # With those 100 users we ramped up to in the first phase
        rampTo: 100 # And keep it steady at 100 users
        name: "Pushing a constant load"
scenarios:
    - engine: "ws"
      flow:
        - send: '{"type":"broadcast","payload":{"foo": "bar"}}'
        - think: 15 # Every connection will remain open for 15s